data_generation/simulation_results/of/case_37/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication chtMultiRegionSimpleFoam
runApplication foamToVTK -fields '(p U T)' -no-boundary -noFunctionObjects -allRegions -no-point-data -noZero

#------------------------------------------------------------------------------
