data_generation/simulation_results/of/case_37/constant/simParams
nIter 2000;
hComponent0 1498.1803894701147;
hComponent1 571.2664664452558;
hComponent2 799.9915943958703;
hComponent3 730.4235583684209;
hComponent4 900.2028032123599;kComponent0 93.05905927187578;
kComponent1 51.642501934155746;
kComponent2 68.1767699187372;
kComponent3 80.36691302023337;
kComponent4 46.247210701381995;
tAmbient 300;
Ux 1.772500365848174;
kPCB 0.18934298468384908;